#+TITLE: ASM-GP: Assembly Genetic Programming
#+OPTIONS: num:nil ^:nil
#+LaTeX_CLASS: normal
#+STARTUP: hideblocks

*** random small math scripts
in =data/boilerplate.2010-01-01.tar.bz2=

so I've collected 5 simple math programs written in C in the
=boilerplate= directory totaling 114 lines of code (including
comments).
: for i in boilerplate/*.c {cat $i |wc}

|  12 |  33 | 227 |
|  14 |  39 | 263 |
|  12 |  40 | 264 |
|  53 | 172 | 978 |
|  23 |  59 | 321 |
|-----+-----+-----|
| 114 |     |     |
#+TBLFM: $1=vsum(@1..@-1)

: for i in boilerplate/*.s {cat $i |wc}
|  46 | 117 |  784 |
|  51 | 130 |  847 |
|  51 | 130 |  847 |
|  68 | 170 | 1182 |
|  81 | 167 | 1110 |
|-----+-----+------|
| 297 |     |      |
#+TBLFM: $1=vsum(@1..@-1)

or 297 lines of assembly.

I'll now take these and find common patterns of commands in their
assembly code with [[usage-profiling]].

